[
  {
    "term": "интерпретатор",
    "definition": "етатор\nопределение - программа, выполняющая обосрочный анализ, обработку и выполнение исходного кода Python.",
    "start": 0.0,
    "end": 31.96
  },
  {
    "term": "литерал",
    "definition": "переменная, которая хранит конкретное значение данных (например, число, строку или булево значение).",
    "start": 0.0,
    "end": 31.96
  },
  {
    "term": "константа",
    "definition": "это значение, которое не меняется во время выполнения программы. В языке Python константы могут быть числовыми (например, 1, 2, 3) или строковыми (например, \"Hello\", \"World\"). Константы используются для хранения данных, которые не изменяются в процессе выполнения программы.",
    "start": 466.82,
    "end": 495.1
  },
  {
    "term": "комментарий",
    "definition": " это кусок текста в программе, который не будет обрабатываться интерпретатором как код, а просто пропускается. Комментарии обычно используются для документирования и пояснения функционала кода.",
    "start": 583.0,
    "end": 641.2
  },
  {
    "term": "python-консоль",
    "definition": "это интерфейс командной строки для выполнения кода на языке программирования Python. Он позволяет пользователю вводить и выполнять код на языке Python, а также просматривать результаты выполнения кода.",
    "start": 73.96,
    "end": 96.76
  },
  {
    "term": "open",
    "definition": "доступ к файлам и каталогам, а также выполнение команд в терминале.",
    "start": 263.16,
    "end": 309.8
  },
  {
    "term": "python",
    "definition": "язык программирования с открытым исходным кодом, который может быть использован для разработки веб-приложений, научных и математических расчетов, а также для создания игр. Он имеет простой синтаксис и интерпретируемый код, что делает его доступным для изучения и использования различными пользователями.",
    "start": 0.0,
    "end": 31.96
  },
  {
    "term": "ide",
    "definition": "интегрированная среда разработки (Integrated Development Environment) - это программное обеспечение для создания и тестирования программного кода, которое содержит в себе все необходимые инструменты для разработки.",
    "start": 434.44,
    "end": 472.18
  },
  {
    "term": "input",
    "definition": "ввод данных пользователя в программе.",
    "start": 434.44,
    "end": 472.18
  }
]